using MgtuBaumanIu3.Core;

namespace MgtuBaumanIu3.Vidmanov.Task4.Part3;

/// <summary>
/// Творческое задание: Вы участвуете в разработке компьютерной игры. В качестве объектов
/// игрового мира выступают средства транспорта различных типов:
/// гужевая повозка
/// автомобиль
/// самолёт
/// катер
/// Требуется реализовать эти классы, затем протестировать их с помощью описанных
/// процедур перемещения, изменения состояния.
/// Все ТС могут совершать перемещения. Однако каждое перемещение приводит к
/// ухудшению качества ТС. У каждого типа ТС происходят в процессе перемещения свои
/// изменения. Изменения сказываются на дальнейшей работоспособности. Подробные
/// характеристики каждого типа ТС могут включать:
/// остаток топлива в топливном баке
/// запас хода категорию прав для управления износ и другие.
/// Сами перемещения можно выполнять непосредственно. Результат работы с объектами
/// классов вывести в виде таблицы.
/// </summary>
public class Quest : IQuest
{
    public void Start()
    {
        throw new NotImplementedException();
    }
}